---
kind: property
id: P:Autodesk.Revit.DB.SunAndShadowSettings.SunriseToSunset
source: html/72802bd9-8241-b14d-97f3-c915861485a2.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.SunriseToSunset Property

Identifies whether the current single day sun study is set to run from
 sunrise to sunset.

## Syntax (C#)
```csharp
public bool SunriseToSunset { get; set; }
```